{
	"version": "https://jsonfeed.org/version/1",
	"title": "micahrl (whispering)",
	"icon": "https://micro.blog/micahrl/avatar.jpg",
	"home_page_url": "https://whispers.micahrl.com/",
	"feed_url": "https://whispers.micahrl.com/feed.json",
	"items": [
		
			{
				"id": "http://micahrl.micro.blog/2023/05/23/copiloting-llms-building.html",
				"title": "Copiloting LLMs building GUIs",
				"content_html": "<p>Hypothesis: LLMs will enable developers like me to build apps that require a serviceable but not world class graphical UI. This could unlock a deluge of applications built from or inspired by existing open-source command-line apps that don&rsquo;t have a GUI complement, especially mobile apps.</p>\n<p>One reason I&rsquo;ve always liked the command line is that it&rsquo;s easy to build a decent UI - even a good one. I&rsquo;ve churned out a few dozen lines of python to create a great little CLI many times over the years, and it only takes a few minutes now. But GUIs are such a deep subject that require their own expertise, and all the GUIs I&rsquo;ve built have taken weeks.</p>\n<p>I started a SwiftUI app in Xcode yesterday and found myself missing Copilot immediately. I haven&rsquo;t used Swift in a long time, and I&rsquo;ve never used SwiftUI, so the median Copilot suggestion would have been extremely welcome. But what I realized I <em>really</em> wanted to ask a hypothetical XCode Copilot is &ldquo;what&rsquo;s the normal way to build an app that has one main screen and some sub-views in SwiftUI?&rdquo;. I had no idea how to do this, and I wasn&rsquo;t contexted enough in SwiftUI to ask the right questions.</p>\n<p>In my experience with actual Github Copilot, and also with ChatGPT, questions about the normal way to do something get the best results. I&rsquo;ve never seen a useful answer inventing new techniques, but they can certainly give you the average quicksort implementation (and explain it too). If they can do that for building simple GUIs, that will let a lot of command-line programmers like me graduate to baby&rsquo;s first mobile app.</p>\n<p>All of this would be really great even for users, because it might be the rising tide that takes open source software GUIs from subpar to good enough. I am guessing that there are thousands of useful apps that have very simple UIs with just a few screens, and that maybe there are thousands more that complement existing open source command-line programs which could be built if making the GUI was easier.</p>\n<p>I&rsquo;m not sure if the LLMs are there today; I haven&rsquo;t built any graphical UIs with Copilot. I wonder what the state of this is at Google with Android Studio, or at Microsoft with whatever its mobile app GUI system is, or at Microsoft with Visual Studio (the big one, not VS Code). It seems like it&rsquo;s too early to be optimized in any direction yet, but maybe they have this already. Would be neat to try it out.</p>\n",
				"content_text": "Hypothesis: LLMs will enable developers like me to build apps that require a serviceable but not world class graphical UI. This could unlock a deluge of applications built from or inspired by existing open-source command-line apps that don't have a GUI complement, especially mobile apps.\n\nOne reason I've always liked the command line is that it's easy to build a decent UI - even a good one. I've churned out a few dozen lines of python to create a great little CLI many times over the years, and it only takes a few minutes now. But GUIs are such a deep subject that require their own expertise, and all the GUIs I've built have taken weeks.\n\nI started a SwiftUI app in Xcode yesterday and found myself missing Copilot immediately. I haven't used Swift in a long time, and I've never used SwiftUI, so the median Copilot suggestion would have been extremely welcome. But what I realized I _really_ wanted to ask a hypothetical XCode Copilot is \"what's the normal way to build an app that has one main screen and some sub-views in SwiftUI?\". I had no idea how to do this, and I wasn't contexted enough in SwiftUI to ask the right questions.\n\nIn my experience with actual Github Copilot, and also with ChatGPT, questions about the normal way to do something get the best results. I've never seen a useful answer inventing new techniques, but they can certainly give you the average quicksort implementation (and explain it too). If they can do that for building simple GUIs, that will let a lot of command-line programmers like me graduate to baby's first mobile app.\n\nAll of this would be really great even for users, because it might be the rising tide that takes open source software GUIs from subpar to good enough. I am guessing that there are thousands of useful apps that have very simple UIs with just a few screens, and that maybe there are thousands more that complement existing open source command-line programs which could be built if making the GUI was easier.\n\nI'm not sure if the LLMs are there today; I haven't built any graphical UIs with Copilot. I wonder what the state of this is at Google with Android Studio, or at Microsoft with whatever its mobile app GUI system is, or at Microsoft with Visual Studio (the big one, not VS Code). It seems like it's too early to be optimized in any direction yet, but maybe they have this already. Would be neat to try it out.\n",
				"date_published": "2023-05-23T10:35:35-05:00",
				"url": "https://whispers.micahrl.com/2023/05/23/copiloting-llms-building.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/05/18/homelab-aesthetic-quotes.html",
				"title": "Homelab aesthetic quotes from computers are bad",
				"content_html": "<blockquote>\n<p>And I think that&rsquo;s how I became the person I am today: I want computer networks to operate in as straightforward and tangible a fashion as they did in 2009. And I want a lot of cabling.</p>\n<p>&hellip;</p>\n<p>Pihole forms part of a split-horizon DNS arrangement on the top-level domain I use, which is such a nice name I made it available on FreeDNS where it is used by a dozen poorly run Minecraft servers. This introduces an interesting set of DNS hijacking and misconfiguration hazards, which I find aesthetically pleasing.</p>\n</blockquote>\n<ul>\n<li><a href=\"https://computer.rip/2023-02-13-my-homelab.html\">&ldquo;my homelab&rdquo; - computers are bad</a></li>\n</ul>\n",
				"content_text": "> And I think that's how I became the person I am today: I want computer networks to operate in as straightforward and tangible a fashion as they did in 2009. And I want a lot of cabling.\n> \n>...\n>\n> Pihole forms part of a split-horizon DNS arrangement on the top-level domain I use, which is such a nice name I made it available on FreeDNS where it is used by a dozen poorly run Minecraft servers. This introduces an interesting set of DNS hijacking and misconfiguration hazards, which I find aesthetically pleasing.\n\n- [\"my homelab\" - computers are bad](https://computer.rip/2023-02-13-my-homelab.html)\n",
				"date_published": "2023-05-18T08:41:05-05:00",
				"url": "https://whispers.micahrl.com/2023/05/18/homelab-aesthetic-quotes.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/05/17/a-routerenforced-eula.html",
				"title": "A router-enforced EULA for IoT devices",
				"content_html": "<p>A recent <a href=\"https://tweets.micahrl.com/twarchive/1595281933696749569/\">shower thought</a>: consumer routers could enforce good IoT manufacturer behavior by placing devices on a secure, contained network by default, and allowing full access only if a device is receiving security updates.</p>\n<p>The default network would be slower and heavily limited in endpoints it could hit, and in particular would not allow accessing any other devices on the local network. If an IoT manufacturer commits to security updates, they could be allowed on the full network. Defection could be subject to legal liabilities, up to a lawsuit in the worst case.</p>\n<p>Over time, the feature could become more sophisticated, for instance by providing a better EOL experience. Currently, IoT manufacturers just leave their waste with the customer and mostly don&rsquo;t even tell them (a <a href=\"https://schwarztech.net/snippets/researchers-find-security-flaw-in-wemo-smart-plug-belkin-says-it-wont-release-a-patch\">recent example</a>). This system might:</p>\n<ul>\n<li>offer an API on the router that devices call to register their EOL date</li>\n<li>inform users when a device approaches EOL</li>\n<li>show a dashboard of devices and how long they&rsquo;re supported</li>\n<li>automatically contain devices that reach EOL</li>\n</ul>\n<p>Come to think of it, there&rsquo;s nothing that would technically restrict this to IoT devices. PCs could opt into this too. Probably most useful as a form of parental management of children&rsquo;s devices &ndash; baby&rsquo;s first mdm.</p>\n<p>Router manufacturers would have to step up their own game, but they also would get upside: more customer touchpoints.</p>\n<p>The best version of this would be an open standard, preserving consumer choice and competition. The hope would be that it improves baseline, even if industry consensus is hard. In the worst case, the consumer isn&rsquo;t served because the standard is captured by the industry, which could then mislead in product ads and/or abuse the customer communications channels with ads.</p>\n",
				"content_text": "A recent [shower thought](https://tweets.micahrl.com/twarchive/1595281933696749569/): consumer routers could enforce good IoT manufacturer behavior by placing devices on a secure, contained network by default, and allowing full access only if a device is receiving security updates.\n\nThe default network would be slower and heavily limited in endpoints it could hit, and in particular would not allow accessing any other devices on the local network. If an IoT manufacturer commits to security updates, they could be allowed on the full network. Defection could be subject to legal liabilities, up to a lawsuit in the worst case.\n\nOver time, the feature could become more sophisticated, for instance by providing a better EOL experience. Currently, IoT manufacturers just leave their waste with the customer and mostly don't even tell them (a [recent example](https://schwarztech.net/snippets/researchers-find-security-flaw-in-wemo-smart-plug-belkin-says-it-wont-release-a-patch)). This system might:\n\n- offer an API on the router that devices call to register their EOL date\n- inform users when a device approaches EOL\n- show a dashboard of devices and how long they're supported\n- automatically contain devices that reach EOL\n\nCome to think of it, there's nothing that would technically restrict this to IoT devices. PCs could opt into this too. Probably most useful as a form of parental management of children's devices -- baby's first mdm.\n\nRouter manufacturers would have to step up their own game, but they also would get upside: more customer touchpoints.\n\nThe best version of this would be an open standard, preserving consumer choice and competition. The hope would be that it improves baseline, even if industry consensus is hard. In the worst case, the consumer isn't served because the standard is captured by the industry, which could then mislead in product ads and/or abuse the customer communications channels with ads. \n",
				"date_published": "2023-05-17T18:24:08-05:00",
				"url": "https://whispers.micahrl.com/2023/05/17/a-routerenforced-eula.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/05/16/ironic-to-use.html",
				
				"content_html": "<p>Ironic to use social sanctions (&ldquo;climate incinerating&rdquo;, etc) against cryptocurrency people. The whole point of proof-of-* systems is that social sanctions don&rsquo;t work. An attack that the targets are inoculated against by definition.</p>\n",
				"content_text": "Ironic to use social sanctions (\"climate incinerating\", etc) against cryptocurrency people. The whole point of proof-of-* systems is that social sanctions don't work. An attack that the targets are inoculated against by definition.\n",
				"date_published": "2023-05-16T11:19:55-05:00",
				"url": "https://whispers.micahrl.com/2023/05/16/ironic-to-use.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/05/15/qubes-whonix-is.html",
				
				"content_html": "<p><a href=\"https://qubes-os.org\">Qubes</a> + <a href=\"https://www.whonix.org\">Whonix</a> is one of the best ways to make sure you don&rsquo;t leak your identity on Tor but I keep getting nerd sniped. Should I use split SSH?; I don&rsquo;t use GPG for anything but maybe I could&hellip;; Oh neat, automatic VM creation with Salt; &hellip;</p>\n",
				"content_text": "[Qubes](https://qubes-os.org) + [Whonix](https://www.whonix.org) is one of the best ways to make sure you don't leak your identity on Tor but I keep getting nerd sniped. Should I use split SSH?; I don't use GPG for anything but maybe I could...; Oh neat, automatic VM creation with Salt; ... \n",
				"date_published": "2023-05-15T23:24:09-05:00",
				"url": "https://whispers.micahrl.com/2023/05/15/qubes-whonix-is.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/20/musing-on-ai.html",
				"title": "Musing on AI tools",
				"content_html": "<p>Regarding AI prose suggestions like <a href=\"https://twitter.com/benparr/status/1635684322261729282\">this</a>, it seems to me that there&rsquo;s a big divide between documents intended for others and notes intended for personal use. Clearly you wouldn&rsquo;t want short sentences like &ldquo;I&rsquo;m on it&rdquo; to translate to 2 paragraphs in <a href=\"https://inkdrop.app\">inkdrop.app</a> (my notes app of choice) or <a href=\"https://obsidian.md\">obsidian.md</a>.</p>\n<p>One place I have noticed this myself is in Github Copilot - so far, its code suggestions have been more helpful than its comment suggestions. In my limited experience, I get idiomatic, non-flowery code that could have been written by anyone, but I get comments that sound off to me. Sometimes the tone strikes me as actively obnoxious; I think this is just that it doesn&rsquo;t feel like I wrote it or could identify with it. I rarely use Copilot&rsquo;s comments.</p>\n<p>Worse, I find them distracting. I don&rsquo;t find its code completion nearly as distracting as how it tries to finish my English sentences in comments. Prior to the latest AI feature rollout from Google, there were ubiquitous short phrase suggestions in Docs and Gmail, which I also found distracting in a similar way. They derail my train of thought, and I end up losing time rather than saving it.</p>\n<hr>\n<p>&hellip; although I&rsquo;ve also been thinking of ways such verbose automatic rewrites might be helpful.</p>\n<p>One hypothetical: if everyone uses ML suggestions, and everyone knows that everyone is using ML suggestions, then you could imagine spending a lot less time analyzing the tone of professional communication for personal slights. For all but the most overt slights, there&rsquo;s plausible deniability in &ldquo;oh well, that was just the AI&rdquo;. This might make fractious professional relationships less uncomfortable, or prevent them from arising in the first place.</p>\n<hr>\n<p>The fact that the appropriateness of a given suggestion is partly determined by its audience prompts the idea that the machine could have many audiences in mind and the user could choose between them. It might have generic heuristics about professional communication or notes to self, or specific training about the way the CEO likes to hear about production problems.</p>\n<hr>\n<p>And that idea, of choosing an audience for suggestions, prompts an idea that the AI text generation could happen at the time of reading, rather than the time of writing. I wonder if there will ever be a need for a low level conceptual representation that the AI could translate for any type of target audience, like <a href=\"https://en.wikipedia.org/wiki/Intermediate_representation\">IR</a> for natural language.</p>\n<p>Maybe this starts off by converting the user&rsquo;s natural language input to something that looks like an English prompt. &ldquo;Hello, I hope this email finds you well.&rdquo; -&gt; &ldquo;greeting, professional, short, top of email, trending on greetingstation, let&rsquo;s greet step by step&rdquo;. Or maybe it&rsquo;s something lower level, some occult binary format that only a dedicated <a href=\"https://en.wikipedia.org/wiki/Reverse_engineering\">reverser</a> could love.</p>\n<hr>\n<p>You&rsquo;ve gotten to the bottom of the post, so I can admit it here: I didn&rsquo;t have any artificial help writing this post. I didn&rsquo;t even reach out to Bing for comment. This way, I get to keep all the mistakes for myself.</p>\n",
				"content_text": "Regarding AI prose suggestions like [this](https://twitter.com/benparr/status/1635684322261729282), it seems to me that there's a big divide between documents intended for others and notes intended for personal use. Clearly you wouldn't want short sentences like \"I'm on it\" to translate to 2 paragraphs in [inkdrop.app](https://inkdrop.app) (my notes app of choice) or [obsidian.md](https://obsidian.md).\n\nOne place I have noticed this myself is in Github Copilot - so far, its code suggestions have been more helpful than its comment suggestions. In my limited experience, I get idiomatic, non-flowery code that could have been written by anyone, but I get comments that sound off to me. Sometimes the tone strikes me as actively obnoxious; I think this is just that it doesn't feel like I wrote it or could identify with it. I rarely use Copilot's comments.\n\nWorse, I find them distracting. I don't find its code completion nearly as distracting as how it tries to finish my English sentences in comments. Prior to the latest AI feature rollout from Google, there were ubiquitous short phrase suggestions in Docs and Gmail, which I also found distracting in a similar way. They derail my train of thought, and I end up losing time rather than saving it.\n\n---\n\n... although I've also been thinking of ways such verbose automatic rewrites might be helpful.\n\nOne hypothetical: if everyone uses ML suggestions, and everyone knows that everyone is using ML suggestions, then you could imagine spending a lot less time analyzing the tone of professional communication for personal slights. For all but the most overt slights, there's plausible deniability in \"oh well, that was just the AI\". This might make fractious professional relationships less uncomfortable, or prevent them from arising in the first place.\n\n---\n\nThe fact that the appropriateness of a given suggestion is partly determined by its audience prompts the idea that the machine could have many audiences in mind and the user could choose between them. It might have generic heuristics about professional communication or notes to self, or specific training about the way the CEO likes to hear about production problems.\n\n---\n\nAnd that idea, of choosing an audience for suggestions, prompts an idea that the AI text generation could happen at the time of reading, rather than the time of writing. I wonder if there will ever be a need for a low level conceptual representation that the AI could translate for any type of target audience, like [IR](https://en.wikipedia.org/wiki/Intermediate_representation) for natural language.\n\nMaybe this starts off by converting the user's natural language input to something that looks like an English prompt. \"Hello, I hope this email finds you well.\" -> \"greeting, professional, short, top of email, trending on greetingstation, let's greet step by step\". Or maybe it's something lower level, some occult binary format that only a dedicated [reverser](https://en.wikipedia.org/wiki/Reverse_engineering) could love.\n\n---\n\nYou've gotten to the bottom of the post, so I can admit it here: I didn't have any artificial help writing this post. I didn't even reach out to Bing for comment. This way, I get to keep all the mistakes for myself.\n\n",
				"date_published": "2023-03-20T12:54:02-05:00",
				"url": "https://whispers.micahrl.com/2023/03/20/musing-on-ai.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/17/blue-skies-sierra.html",
				
				"content_html": "<p>Blue skies, Sierra Ferrel, chickenshit bingo. Thanks <a href=\"https://luckpresents.com/luck-tx-events/2023luckreunion\">Luck</a>.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Blue skies, Sierra Ferrel, chickenshit bingo. Thanks [Luck](https://luckpresents.com/luck-tx-events/2023luckreunion).\n\n<img src=\"https://cdn.uploads.micro.blog/103095/2023/4dd496c2b3.jpg\" width=\"600\" height=\"599\" alt=\"\"><img src=\"https://cdn.uploads.micro.blog/103095/2023/9131f124e3.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-17T22:37:49-05:00",
				"url": "https://whispers.micahrl.com/2023/03/17/blue-skies-sierra.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/16/this-would-have.html",
				
				"content_html": "<p>This would have been my dream laptop until my 2019 onset of RSI :( I miss working out of coffee shops <a href=\"https://www.crowdsupply.com/mnt/pocket-reform\">www.crowdsupply.com/mnt/pocke&hellip;</a></p>\n",
				"content_text": "This would have been my dream laptop until my 2019 onset of RSI :( I miss working out of coffee shops [www.crowdsupply.com/mnt/pocke...](https://www.crowdsupply.com/mnt/pocket-reform)\n",
				"date_published": "2023-03-16T12:13:51-05:00",
				"url": "https://whispers.micahrl.com/2023/03/16/this-would-have.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/15/til-narrow-banking.html",
				"title": "TIL: Narrow banking",
				"content_html": "<p>Fascinating history that feels very relevant today: there was <a href=\"https://johnhcochrane.blogspot.com/2018/09/fed-nixes-narrow-bank.html\">recently a bank startup called TNB</a> that tried to offer <a href=\"https://en.m.wikipedia.org/wiki/Full-reserve_banking\">&ldquo;narrow banking&rdquo;</a> which would have offered deposit accounts and plops the result directly in the Fed, passing interest to customers (nearly 2% in 2018, although obviously finance people use the obfuscated language of &ldquo;basis points&rdquo; to make everything seem more complicated than it really is). The opposite of <a href=\"https://en.m.wikipedia.org/wiki/Fractional-reserve_banking\">fractional-reserve banking</a>.</p>\n<p>The Fed did not approve this, and the startup <a href=\"https://www.tnbusa.com\">says</a> it &ldquo;seeks to offer&rdquo; narrow banking to this day &ndash; it cannot accept deposits.</p>\n<p>This is relevant to today because <em>runs are impossible</em> in a narrow bank, and FDIC deposit insurance (which has a $250,000 limit) is not necessary. A regular bank takes your money in deposit and immediately loans it out. The bank has a lot of money in absolute terms sitting around liquid so that customers can withdraw approximately whenever they want to, but <em>most</em> money they hold is actually loaned out and therefore illiquid, such that if too many of their customers withdraw at once they will not be able to access it. (This is what happened to SVB.) By contrast, a narrow bank is much simpler; it can always get all of your money immediately from the Fed.</p>\n<p>The inimitable Matt Levine <a href=\"https://www.bloomberg.com/view/articles/2018-09-06/fed-rejects-bank-for-being-too-safe\">covered TNB in more approachable language</a>. Basically, if we had that, then why would regular depositors put their money in a regular bank? Maybe they wouldn&rsquo;t. And if customers didn&rsquo;t use regular banks <em>at scale</em>, then maybe your Chase Bank and your Bank of America don&rsquo;t exist any more, and maybe it&rsquo;s hard to figure out of that&rsquo;s bad for society or not.</p>\n<p>So the Fed just stonewalled. I have no position on whether this was right or wrong. But it&rsquo;s pretty weird! Runs are impossible in a narrow bank, but also probably business loans of various kinds are more expensive. Maybe that&rsquo;s worse?</p>\n",
				"content_text": "Fascinating history that feels very relevant today: there was [recently a bank startup called TNB](https://johnhcochrane.blogspot.com/2018/09/fed-nixes-narrow-bank.html) that tried to offer [\"narrow banking\"](https://en.m.wikipedia.org/wiki/Full-reserve_banking) which would have offered deposit accounts and plops the result directly in the Fed, passing interest to customers (nearly 2% in 2018, although obviously finance people use the obfuscated language of \"basis points\" to make everything seem more complicated than it really is). The opposite of [fractional-reserve banking](https://en.m.wikipedia.org/wiki/Fractional-reserve_banking).\n\nThe Fed did not approve this, and the startup [says](https://www.tnbusa.com) it \"seeks to offer\" narrow banking to this day -- it cannot accept deposits. \n\nThis is relevant to today because _runs are impossible_ in a narrow bank, and FDIC deposit insurance (which has a $250,000 limit) is not necessary. A regular bank takes your money in deposit and immediately loans it out. The bank has a lot of money in absolute terms sitting around liquid so that customers can withdraw approximately whenever they want to, but _most_ money they hold is actually loaned out and therefore illiquid, such that if too many of their customers withdraw at once they will not be able to access it. (This is what happened to SVB.) By contrast, a narrow bank is much simpler; it can always get all of your money immediately from the Fed.\n\nThe inimitable Matt Levine [covered TNB in more approachable language](https://www.bloomberg.com/view/articles/2018-09-06/fed-rejects-bank-for-being-too-safe). Basically, if we had that, then why would regular depositors put their money in a regular bank? Maybe they wouldn't. And if customers didn't use regular banks _at scale_, then maybe your Chase Bank and your Bank of America don't exist any more, and maybe it's hard to figure out of that's bad for society or not.\n\nSo the Fed just stonewalled. I have no position on whether this was right or wrong. But it's pretty weird! Runs are impossible in a narrow bank, but also probably business loans of various kinds are more expensive. Maybe that's worse?\n",
				"date_published": "2023-03-15T20:54:59-05:00",
				"url": "https://whispers.micahrl.com/2023/03/15/til-narrow-banking.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/15/pls-do-not.html",
				
				"content_html": "<p>PLS DO NOT TAKE</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "PLS DO NOT TAKE\n\n<img src=\"https://cdn.uploads.micro.blog/103095/2023/e140fe4768.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"https://cdn.uploads.micro.blog/103095/2023/232337a204.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-15T19:10:53-05:00",
				"url": "https://whispers.micahrl.com/2023/03/15/pls-do-not.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/13/imagine-browsers-offering.html",
				
				"content_html": "<p>Imagine browsers offering synced <code>window.localStorage</code>, with an in-browser UI for whether you&rsquo;re logged in to a site. It would be like iCloud for the web - syncing data via your browser sync password, obviating the need to create a new account for every application that wants to store data, as you&rsquo;re already logged in to iCloud.</p>\n<p>Conceptually, the user could whitelist sites to allow this; the browser would integrate the whitelist into the log-in UI. This would let the browser keep you logged in forever, fixing the terrible short cookie expiry timelines that browsers enforce now to limit tracking. The in-browser UI would be unspoofable (like eg the Firefox extension installation UI), and it would be impossible to phish the credentials (sort of &ndash; attackers could phish the credentials for the sync service, but not individual websites that use it).</p>\n<p>Allowing data to live forever, sync across devices, and be tied to the browser sync profile would mean that apps could rely on static hosting for JavaScript/WebAssembly, and <code>localStorage</code> for user data. Today, lots of apps basically use a server just for hosting user data since browser storage is so unreliable &ndash; those apps could be ported to the web (many automatically with webasm) and live ~forever without requiring hosting costs and security updates. Basically any app designed to run on a desktop operating system and save data to the hard drive could be ported &ndash; MS Paint, Text Edit.app, a full Linux virtual machine with a persistent filesystem via <a href=\"https://copy.sh/v86/\">v86</a>.</p>\n<p>Details to work out: Do you allow sharing data between websites? iCloud doesn&rsquo;t, which is annoying, but the implementation is simpler. The best implementations would be end-to-end encrypted. Ideally, you&rsquo;d be able to mix and match storage providers between different browsers, like using Firefox on Windows to sync with Safari on an iPad.</p>\n<p>A browser extension could do this, but then sites would have to support it specifically. Might be useful as a proof of concept though. I wonder if there are enough primitives in Safari extensions to implement it today?</p>\n",
				"content_text": "Imagine browsers offering synced `window.localStorage`, with an in-browser UI for whether you're logged in to a site. It would be like iCloud for the web - syncing data via your browser sync password, obviating the need to create a new account for every application that wants to store data, as you're already logged in to iCloud.\r\n\r\nConceptually, the user could whitelist sites to allow this; the browser would integrate the whitelist into the log-in UI. This would let the browser keep you logged in forever, fixing the terrible short cookie expiry timelines that browsers enforce now to limit tracking. The in-browser UI would be unspoofable (like eg the Firefox extension installation UI), and it would be impossible to phish the credentials (sort of -- attackers could phish the credentials for the sync service, but not individual websites that use it).\r\n\r\nAllowing data to live forever, sync across devices, and be tied to the browser sync profile would mean that apps could rely on static hosting for JavaScript/WebAssembly, and `localStorage` for user data. Today, lots of apps basically use a server just for hosting user data since browser storage is so unreliable -- those apps could be ported to the web (many automatically with webasm) and live ~forever without requiring hosting costs and security updates. Basically any app designed to run on a desktop operating system and save data to the hard drive could be ported -- MS Paint, Text Edit.app, a full Linux virtual machine with a persistent filesystem via [v86](https://copy.sh/v86/).\r\n\r\nDetails to work out: Do you allow sharing data between websites? iCloud doesn't, which is annoying, but the implementation is simpler. The best implementations would be end-to-end encrypted. Ideally, you'd be able to mix and match storage providers between different browsers, like using Firefox on Windows to sync with Safari on an iPad.\r\n\r\nA browser extension could do this, but then sites would have to support it specifically. Might be useful as a proof of concept though. I wonder if there are enough primitives in Safari extensions to implement it today?\n",
				"date_published": "2023-03-13T21:38:19-05:00",
				"url": "https://whispers.micahrl.com/2023/03/13/imagine-browsers-offering.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/13/circa-or-so.html",
				
				"content_html": "<p>Circa 2000 or so, my family went on vacation to South Carolina to visit my grandparents. Here I am pictured with the most important member of my family (StarCraft) which I brought on the plane and insisted my grandfather install on the PC he used for work.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Circa 2000 or so, my family went on vacation to South Carolina to visit my grandparents. Here I am pictured with the most important member of my family (StarCraft) which I brought on the plane and insisted my grandfather install on the PC he used for work.\n\n<img src=\"https://cdn.uploads.micro.blog/103095/2023/fcef8762b3.jpg\" width=\"600\" height=\"400\" alt=\"\">\n",
				"date_published": "2023-03-13T20:21:47-05:00",
				"url": "https://whispers.micahrl.com/2023/03/13/circa-or-so.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/13/experimenting-with-a.html",
				
				"content_html": "<p>Experimenting with a micro.blog account. Goals:</p>\n<ul>\n<li>keep posts on my own domain&hellip;</li>\n<li>&hellip; but also be able to easily write from my phone</li>\n<li>write short and medium posts (long ones on main blog)</li>\n<li>keep a foot in the door at Twitter by cross posting</li>\n</ul>\n",
				"content_text": "Experimenting with a micro.blog account. Goals:\r\n\r\n* keep posts on my own domain...\r\n* ... but also be able to easily write from my phone\r\n* write short and medium posts (long ones on main blog)\r\n* keep a foot in the door at Twitter by cross posting\n",
				"date_published": "2023-03-13T20:01:03-05:00",
				"url": "https://whispers.micahrl.com/2023/03/13/experimenting-with-a.html"
			},
			{
				"id": "http://micahrl.micro.blog/2023/03/13/test-post-pls.html",
				
				"content_html": "<p>Test post, pls ignore</p>\n",
				"content_text": "Test post, pls ignore\n",
				"date_published": "2023-03-13T19:57:23-05:00",
				"url": "https://whispers.micahrl.com/2023/03/13/test-post-pls.html"
			}
	]
}
